app/views/messages/_message.html.erb

                <div class="message_timestamp">
                    <%= message.created_at.strftime("%H:%M:%S")%>
---
INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "fveve"], ["user_id", 3], ["created_at", "2023-08-31 06:55:23.384686"], ["updated_at", "2023-08-31 06:55:23.384686"]]