app/controllers/messages_controller.rb

    def create
        message = current_user.messages.build(message_params)
        message.save
---
INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "fveve"], ["user_id", 3], ["created_at", "2023-08-31 06:55:23.384686"], ["updated_at", "2023-08-31 06:55:23.384686"]]