app/controllers/pages_controller.rb

SELECT "messages".* FROM "messages" ORDER BY "messages"."id" DESC LIMIT ?  [["LIMIT", 5]]
---
  def home
    @messages = Message.last(5)